export const Experiences = [
  {
    title: "프로그라운드",
    subtitle: "프론트엔드 개발자",
    about:
      "러닝 애플리케이션으로 시작해, 최근 Web 3.0 기술과 토큰 경제를 융합하여 새로운 피트니스 플랫폼으로 발전한 스타트업",
    date: "2021.06 - 2022.09",
    jobs: [
      {
        title: "러닝 트래킹 시스템 개발",
        detail: [
          "React Native 기반의 iOS/Android 애플리케이션에서 스마트폰 센서와 GPS를 활용해 러닝 데이터를 장시간 안정적으로 기록하는 시스템 구축",
          "사용자 운동 경험 개선을 목표로 안정적 데이터 기록 및 UI/UX 최적화"
        ]
      },
      {
        title: "블록체인 API통합을 통한 Web3 환경 구축",
        detail: [
          "블록체인 개발자와 협업하여 블록체인 API를 앱에 통합, 사용자에게 Web3 환경에서 코인 관리 기능 제공",
          "블록체인 기술을 활용한 새로운 사용자 경험 창출"
        ]
      },
      {
        title: "게임화된 애니메이션과 동적 UI로 디자인 개선",
        detail: [
          "운동 보상 시스템 컨셉에 맞춘 화려한 애니메이션과 동적 UI를 적용해 사용자의 몰입감과 성취감을 강화",
          "운동 성과 달성 시의 사용자 만족도를 높이는 디자인 개선"
        ]
      },
      {
        title: "외부API 통합으로 기능 확장",
        detail: [
          "Garmin API와 같은 복잡한 인증이 필요한 외부 서비스 API 통합 주도",
          "실시간 맞춤형 데이터를 제공하는 시스템 구축으로 사용자 경험 강화"
        ]
      }
    ],
    links: [{ title: "회사 사이트", link: "https://superwalk.io/ko" }]
  },
  {
    title: "포크쇼핑",
    subtitle: "풀스택 개발자 (인턴)",
    about:
      "리뷰 커머스 플랫폼으로, 유튜브에서 제품별 리뷰 영상을 모아 최저가에 구매할 수 있는 애플리케이션을 제공하는 스타트업",
    date: "2021.03 - 2021.05",
    jobs: [
      {
        title: "관리자 웹 페이지 기능 개발",
        detail: [
          "React를 이용해 관리자 제품 검색 및 등록 기능을 구축하여 운영 효율성을 개선"
        ]
      },
      {
        title: "검색 기능 구축",
        detail: [
          "Flask를 통해 대용량 데이터를 효율적으로 검색할 수 있는 기능을 구축하고, 이를 React Native 애플리케이션에 통합하여 사용자에게 신속한 데이터 검색 서비스를 제공"
        ]
      }
    ],
    links: [{ title: "회사 사이트", link: "https://home.forc.co.kr/" }]
  },
  {
    title: "룸프렌즈",
    subtitle: "백엔드 개발자 (인턴)",
    about:
      "리뷰 커머스 플랫폼으로, 유튜브에서 제품별 리뷰 영상을 모아 최저가에 구매할 수 있는 애플리케이션을 제공하는 스타트업",
    date: "2021.03 - 2021.05",
    jobs: [
      {
        title: "관리자 웹 페이지 기능 개발",
        detail: [
          "React를 이용해 관리자 제품 검색 및 등록 기능을 구축하여 운영 효율성을 개선"
        ]
      },
      {
        title: "검색 기능 구축",
        detail: [
          "Flask를 통해 대용량 데이터를 효율적으로 검색할 수 있는 기능을 구축하고, 이를 React Native 애플리케이션에 통합하여 사용자에게 신속한 데이터 검색 서비스를 제공"
        ]
      }
    ],
    links: [{ title: "회사 사이트", link: "https://www.roomfriends.kr/" }]
  }
];

export const Projects = [
  {
    title: "프로그라운드",
    subtitle: "프론트엔드 개발자",
    about:
      "러닝 애플리케이션으로 시작해, 최근 Web 3.0 기술과 토큰 경제를 융합하여 새로운 피트니스 플랫폼으로 발전한 스타트업",
    date: "2021.06 - 2022.09",
    jobs: [
      {
        title: "러닝 트래킹 시스템 개발",
        detail: [
          "React Native 기반의 iOS/Android 애플리케이션에서 스마트폰 센서와 GPS를 활용해 러닝 데이터를 장시간 안정적으로 기록하는 시스템 구축",
          "사용자 운동 경험 개선을 목표로 안정적 데이터 기록 및 UI/UX 최적화"
        ]
      },
      {
        title: "블록체인 API통합을 통한 Web3 환경 구축",
        detail: [
          "블록체인 개발자와 협업하여 블록체인 API를 앱에 통합, 사용자에게 Web3 환경에서 코인 관리 기능 제공",
          "블록체인 기술을 활용한 새로운 사용자 경험 창출"
        ]
      },
      {
        title: "게임화된 애니메이션과 동적 UI로 디자인 개선",
        detail: [
          "운동 보상 시스템 컨셉에 맞춘 화려한 애니메이션과 동적 UI를 적용해 사용자의 몰입감과 성취감을 강화",
          "운동 성과 달성 시의 사용자 만족도를 높이는 디자인 개선"
        ]
      },
      {
        title: "외부API 통합으로 기능 확장",
        detail: [
          "Garmin API와 같은 복잡한 인증이 필요한 외부 서비스 API 통합 주도",
          "실시간 맞춤형 데이터를 제공하는 시스템 구축으로 사용자 경험 강화"
        ]
      }
    ],
    links: [{ title: "회사 사이트", link: "https://superwalk.io/ko" }]
  },
  {
    title: "포크홀딩스 (포크쇼핑) ",
    subtitle: "풀스택 개발자 (인턴)",
    about:
      "리뷰 커머스 플랫폼으로, 유튜브에서 제품별 리뷰 영상을 모아 최저가에 구매할 수 있는 애플리케이션을 제공하는 스타트업",
    date: "2021.03 - 2021.05",
    jobs: [
      {
        title: "관리자 웹 페이지 기능 개발",
        detail: [
          "React를 이용해 관리자 제품 검색 및 등록 기능을 구축하여 운영 효율성을 개선"
        ]
      },
      {
        title: "검색 기능 구축",
        detail: [
          "Flask를 통해 대용량 데이터를 효율적으로 검색할 수 있는 기능을 구축하고, 이를 React Native 애플리케이션에 통합하여 사용자에게 신속한 데이터 검색 서비스를 제공"
        ]
      }
    ],
    links: [{ title: "회사 사이트", link: "https://home.forc.co.kr/" }]
  },
  {
    title: "룸프랜즈",
    subtitle: "백엔드 개발자 (인턴)",
    about:
      "리뷰 커머스 플랫폼으로, 유튜브에서 제품별 리뷰 영상을 모아 최저가에 구매할 수 있는 애플리케이션을 제공하는 스타트업",
    date: "2021.03 - 2021.05",
    jobs: [
      {
        title: "관리자 웹 페이지 기능 개발",
        detail: [
          "React를 이용해 관리자 제품 검색 및 등록 기능을 구축하여 운영 효율성을 개선"
        ]
      },
      {
        title: "검색 기능 구축",
        detail: [
          "Flask를 통해 대용량 데이터를 효율적으로 검색할 수 있는 기능을 구축하고, 이를 React Native 애플리케이션에 통합하여 사용자에게 신속한 데이터 검색 서비스를 제공"
        ]
      }
    ],
    links: [{ title: "회사 사이트", link: "https://www.roomfriends.kr/" }]
  }
];
